SpenceKonde/megaTinyCore/megaavr/boards.txt
##########################################################################
#      Tools Submenu Names
##########################################################################

menu.chip=Chip
menu.clock=Clock
menu.clocko=Clock (burn bootloader req'd, or see docs)
menu.millis=millis()/micros()
menu.uartvoltage=Voltage for UART baud (ignored for 2k/4k parts)
menu.serialevent=Support SerialEvent
menu.startuptime=Startup Time
menu.startuptimeopti=Startup Time (burn bootloader req'd)
menu.bodvoltage=BOD level if enabled (burn bootloader req'd)
menu.bodmode=BOD Mode when active/sleeping (burn bootloader req'd)
menu.eesave=Save EEPROM (burn bootloader req'd)
menu.bootloaderuart=UART for Bootloader (burn bootloader req'd)
menu.resetpin=UPDI Pin, READ DOCS or pick UPDI! (burn bootloader req'd)
menu.resetpinopti=UPDI/reset pin (burn bootloader req'd)

# The *opti menus are for Optiboot board definitions;
# they function identically, just differ in the
# information shown in the submenu name.

##########################################################################
#      Board Names
##########################################################################

atxy7.name=24-pin tinyAVR 0/1/2-series (ATtinyxxy7)
atxy6.name=20-pin tinyAVR 0/1/2-series (ATtinyxxy6)
atxy4.name=14-pin tinyAVR 0/1/2-series (ATtinyxxy4)
atxy2.name=8-pin ATtiny412/402/212/202
atxy7o.name=24-pin tinyAVR 0/1/2-series w/Optiboot (ATtinyxxy7)
atxy6o.name=20-pin tinyAVR 0/1/2-series w/Optiboot (ATtinyxxy6)
atxy4o.name=14-pin tinyAVR 0/1/2-series w/Optiboot (ATtinyxxy4)
atxy2o.name=9-pin ATtiny412/402/212/202 w/Optiboot
Xplained416.name=Attiny416 Xplained Nano (Optiboot)
Xplained817.name=Attiny817 Xplained Mini (Optiboot)

##########################################################################
#      ATtiny3227/3217/1627/1617/1607/827/817/807/427/417
##########################################################################

atxy7.upload.workaround=
atxy7.build.millistimer=D0
atxy7.build.bootload=
atxy7.build.board=AVR_ATtinyxy7
atxy7.build.mcu=attiny{build.attiny}
atxy7.build.serialeventabr=
atxy7.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy7.build.f_cpu={build.speed}000000L

atxy7.menu.chip.3217=ATtiny3217
atxy7.menu.chip.3217.build.board=AVR_ATtiny3217
atxy7.menu.chip.3217.build.attiny=3217
atxy7.menu.chip.3217.upload.maximum_size=32768
atxy7.menu.chip.3217.upload.maximum_data_size=2048
atxy7.menu.chip.1617=ATtiny1617
atxy7.menu.chip.1617.build.board=AVR_ATtiny1617
atxy7.menu.chip.1617.build.attiny=1617
atxy7.menu.chip.1617.upload.maximum_size=16384
atxy7.menu.chip.1617.upload.maximum_data_size=2048
atxy7.menu.chip.817=ATtiny817
atxy7.menu.chip.817.build.board=AVR_ATtiny817
atxy7.menu.chip.817.build.attiny=817
atxy7.menu.chip.817.upload.maximum_size=8192
atxy7.menu.chip.817.upload.maximum_data_size=512
atxy7.menu.chip.417=ATtiny417
atxy7.menu.chip.417.build.board=AVR_ATtiny417
atxy7.menu.chip.417.build.attiny=417
atxy7.menu.chip.417.upload.maximum_size=4096
atxy7.menu.chip.417.upload.maximum_data_size=256
#atxy7.menu.chip.3227=ATtiny3227
#atxy7.menu.chip.3227.build.board=AVR_ATtiny3227
#atxy7.menu.chip.3227.build.millistimer=A0
#atxy7.menu.chip.3227.build.attiny=3227
#atxy7.menu.chip.3227.upload.maximum_size=32768
#atxy7.menu.chip.3227.upload.maximum_data_size=3072
atxy7.menu.chip.1627=ATtiny1627
atxy7.menu.chip.1627.build.board=AVR_ATtiny1627
atxy7.menu.chip.1627.build.millistimer=A0
atxy7.menu.chip.1627.build.attiny=1627
atxy7.menu.chip.1627.upload.maximum_size=16384
atxy7.menu.chip.1627.upload.maximum_data_size=2048
atxy7.menu.chip.827=ATtiny827
atxy7.menu.chip.827.build.board=AVR_ATtiny827
atxy7.menu.chip.827.build.millistimer=A0
atxy7.menu.chip.827.build.attiny=827
atxy7.menu.chip.827.upload.maximum_size=8192
atxy7.menu.chip.827.upload.maximum_data_size=1024
atxy7.menu.chip.427=ATtiny427
atxy7.menu.chip.427.build.board=AVR_ATtiny427
atxy7.menu.chip.427.build.millistimer=A0
atxy7.menu.chip.427.build.attiny=427
atxy7.menu.chip.427.upload.maximum_size=4096
atxy7.menu.chip.427.upload.maximum_data_size=512
atxy7.menu.chip.1607=ATtiny1607
atxy7.menu.chip.1607.build.board=AVR_ATtiny1607
atxy7.menu.chip.1607.build.attiny=1607
atxy7.menu.chip.1607.build.millistimer=A0
atxy7.menu.chip.1607.upload.maximum_size=16384
atxy7.menu.chip.1607.upload.maximum_data_size=1024
atxy7.menu.chip.807=ATtiny807
atxy7.menu.chip.807.build.board=AVR_ATtiny807
atxy7.menu.chip.807.build.attiny=807
atxy7.menu.chip.807.build.millistimer=A0
atxy7.menu.chip.807.upload.maximum_size=8192
atxy7.menu.chip.807.upload.maximum_data_size=512

atxy7.menu.clock.20internal=20 MHz Internal
atxy7.menu.clock.16internal=16 MHz Internal
atxy7.menu.clock.10internal=10 MHz Internal
atxy7.menu.clock.8internal=8 MHz Internal
atxy7.menu.clock.5internal=5 MHz Internal
atxy7.menu.clock.4internal=4 MHz Internal
atxy7.menu.clock.1internal=1 MHz Internal
atxy7.menu.clock.20extclock=20 MHz External CLOCK
atxy7.menu.clock.16extclock=16 MHz External CLOCK
atxy7.menu.clock.12extclock=12 MHz External CLOCK
atxy7.menu.clock.10extclock=10 MHz External CLOCK
atxy7.menu.clock.8extclock=8 MHz External CLOCK
atxy7.menu.clock.24extclock=24 MHz External CLOCK (overclocked)
atxy7.menu.clock.28extclock=28 MHz External CLOCK (overclocked)
atxy7.menu.clock.32extclock=32 MHz External CLOCK (overclocked)
atxy7.menu.clock.20internal.build.speed=20
atxy7.menu.clock.20internal.build.clocksource=0
atxy7.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy7.menu.clock.16internal.build.speed=16
atxy7.menu.clock.16internal.build.clocksource=0
atxy7.menu.clock.10internal.build.speed=10
atxy7.menu.clock.10internal.build.clocksource=0
atxy7.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy7.menu.clock.8internal.build.speed=8
atxy7.menu.clock.8internal.build.clocksource=0
atxy7.menu.clock.5internal.build.speed=5
atxy7.menu.clock.5internal.build.clocksource=0
atxy7.menu.clock.5internal.bootloader.OSCCFG=0x02
atxy7.menu.clock.4internal.build.speed=4
atxy7.menu.clock.4internal.build.clocksource=0
atxy7.menu.clock.1internal.build.speed=1
atxy7.menu.clock.1internal.build.clocksource=0
atxy7.menu.clock.20extclock.build.speed=20
atxy7.menu.clock.20extclock.build.clocksource=2
atxy7.menu.clock.16extclock.build.speed=16
atxy7.menu.clock.16extclock.build.clocksource=2
atxy7.menu.clock.12extclock.build.speed=12
atxy7.menu.clock.12extclock.build.clocksource=2
atxy7.menu.clock.10extclock.build.speed=10
atxy7.menu.clock.10extclock.build.clocksource=2
atxy7.menu.clock.8extclock.build.speed=8
atxy7.menu.clock.8extclock.build.clocksource=2
atxy7.menu.clock.24extclock.build.speed=24
atxy7.menu.clock.24extclock.build.clocksource=2
atxy7.menu.clock.28extclock.build.speed=28
atxy7.menu.clock.28extclock.build.clocksource=2
atxy7.menu.clock.32extclock.build.speed=32
atxy7.menu.clock.32extclock.build.clocksource=2

