SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy2.menu.resetpin.UPDI=UPDI (pick this unless you have an HV UPDI programmer!)
atxy2.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy2.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
atxy2.menu.resetpin.reset.bootloader.resetpinbits=10
atxy2.menu.resetpin.gpio=IO (DANGER - Bricks chip w/out HV UPDI programmer! Use PCHV)
atxy2.menu.resetpin.gpio.bootloader.resetpinbits=00

atxy2.menu.startuptime.8=8ms
atxy2.menu.startuptime.0=0ms
atxy2.menu.startuptime.1=1ms
atxy2.menu.startuptime.2=2ms
atxy2.menu.startuptime.4=4ms
atxy2.menu.startuptime.16=16ms
atxy2.menu.startuptime.32=32ms
atxy2.menu.startuptime.64=64ms
atxy2.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy2.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy2.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy2.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy2.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy2.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy2.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy2.menu.startuptime.64.bootloader.SYSCFG1=0x07



atxy2.build.core=megatinycore
atxy2.build.variant=txy2
atxy2.build.text_section_start=.text=0x0
atxy2.build.uartvoltage=NA
atxy2.build.extra_flags=-DARDUINO_attinyxy2 {build.serialevent} {build.millis} -DUARTBAUD{build.uartvoltage}
atxy2.build.export_merged_output=false

atxy2.bootloader.tool=avrdude
atxy2.bootloader.WDTCFG=0x00
atxy2.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy2.bootloader.OSCCFG=0x01
atxy2.bootloader.TCD0CFG=0x00
atxy2.bootloader.APPEND=0x00
atxy2.bootloader.BOOTEND=0x00
atxy2.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}

##########################################################################
#      Attiny416 Xplained Nano (Optiboot)
##########################################################################

Xplained416.upload.workaround=
Xplained416.build.millistimer=D0
Xplained416.build.bootload=opti
Xplained416.build.mcu=attiny{build.attiny}
Xplained416.build.serialeventabr=
Xplained416.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
Xplained416.build.f_cpu={build.speed}000000L

Xplained416.build.attiny=416
Xplained416.build.board=AVR_Xplained416
Xplained416.build.core=megatinycore
Xplained416.build.variant=txy6
Xplained416.build.speed=20
Xplained416.build.clocksource=0
Xplained416.build.text_section_start=.text=0x200
Xplained416.build.extra_flags=-DARDUINO_attinyxy6 -DARDUINO_AVR_ATtiny416 {build.serialevent} {build.millis} -DUARTBAUD5V

Xplained416.menu.serialevent.no=No (saves space)
Xplained416.menu.serialevent.yes=Yes
Xplained416.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
Xplained416.menu.serialevent.yes.build.serialevent=
Xplained416.menu.serialevent.yes.build.serialeventabr=E

Xplained416.upload.tool=avrdude
Xplained416.upload.speed=57600
Xplained416.upload.maximum_size=3584
Xplained416.upload.maximum_data_size=256
Xplained416.upload.protocol=arduino
Xplained416.upload.extra_params=-D
Xplained416.bootloader.file=optiboot_x/optiboot_xplained416.hex
Xplained416.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
Xplained416.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/{bootloader.file} -a write
Xplained416.bootloader.tool=avrdude
Xplained416.bootloader.BOOTEND=0x2
Xplained416.bootloader.OSCCFG=0x02
Xplained416.bootloader.WDTCFG=0x00
Xplained416.bootloader.BODCFG=0b00000000
Xplained416.bootloader.TCD0CFG=0x00
Xplained416.bootloader.SYSCFG0=0xC9
Xplained416.bootloader.SYSCFG1=0x07
Xplained416.bootloader.APPEND=0x00

Xplained416.menu.millis.enabled=Enabled (default timer)
Xplained416.menu.millis.disabled=Disabled (saves flash)
Xplained416.menu.millis.timera=TCA0
Xplained416.menu.millis.timerd=TCD0 (default)
Xplained416.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
Xplained416.menu.millis.enabled.build.millistimer=D0
Xplained416.menu.millis.rtc=RTC (no micros)
Xplained416.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (no micros)
Xplained416.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (no micros)
Xplained416.menu.millis.disabled.build.millistimer=NONE
Xplained416.menu.millis.timera.build.millistimer=A0
Xplained416.menu.millis.timerd.build.millistimer=D0
Xplained416.menu.millis.timerb0.build.millistimer=B0
Xplained416.menu.millis.rtc.build.millistimer=RTC
Xplained416.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
Xplained416.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

##########################################################################
#      Attiny817 Xplained Mini (Optiboot)
##########################################################################

Xplained817.upload.workaround=
Xplained817.build.millistimer=D0
Xplained817.build.bootload=opti
Xplained817.build.mcu=attiny{build.attiny}
Xplained817.build.serialeventabr=
Xplained817.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
Xplained817.build.f_cpu={build.speed}000000L

Xplained817.build.attiny=817
Xplained817.build.board=AVR_Xplained817
Xplained817.build.core=megatinycore
Xplained817.build.variant=txy7
Xplained817.build.speed=20
Xplained817.build.clocksource=0
Xplained817.build.text_section_start=.text=0x200
Xplained817.build.extra_flags=-DARDUINO_attinyxy7 -DARDUINO_AVR_ATtiny817 {build.serialevent} {build.millis} -DUARTBAUD5V

Xplained817.menu.serialevent.no=No (saves space)
Xplained817.menu.serialevent.yes=Yes
Xplained817.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
Xplained817.menu.serialevent.yes.build.serialevent=
Xplained817.menu.serialevent.yes.build.serialeventabr=E

Xplained817.upload.tool=avrdude
Xplained817.upload.speed=57600
Xplained817.upload.maximum_size=7680
Xplained817.upload.maximum_data_size=512
Xplained817.upload.protocol=arduino
Xplained817.upload.extra_params=-D
Xplained817.bootloader.file=optiboot_x/optiboot_xplained817.hex
Xplained817.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
Xplained817.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/{bootloader.file} -a write
Xplained817.bootloader.tool=avrdude
Xplained817.bootloader.BOOTEND=0x2
Xplained817.bootloader.OSCCFG=0x02
Xplained817.bootloader.WDTCFG=0x00
Xplained817.bootloader.BODCFG=0b00000000
Xplained817.bootloader.TCD0CFG=0x00
Xplained817.bootloader.SYSCFG0=0xC9
Xplained817.bootloader.SYSCFG1=0x07
Xplained817.bootloader.APPEND=0x00

Xplained817.menu.millis.enabled=Enabled (default timer)
Xplained817.menu.millis.disabled=Disabled (saves flash)
Xplained817.menu.millis.timera=TCA0
Xplained817.menu.millis.timerd=TCD0 (default)
Xplained817.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
Xplained817.menu.millis.rtc=RTC (no micros)
Xplained817.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (no micros)
Xplained817.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (no micros)
Xplained817.menu.millis.enabled.build.millistimer=D0
Xplained817.menu.millis.disabled.build.millistimer=NONE
Xplained817.menu.millis.timera.build.millistimer=A0
Xplained817.menu.millis.timerd.build.millistimer=D0
Xplained817.menu.millis.timerb0.build.millistimer=B0
Xplained817.menu.millis.rtc.build.millistimer=RTC
Xplained817.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
Xplained817.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

##########################################################################
#      ATtiny3227/3217/1627/1617/1607/827/817/807/427/417 (Optiboot)
##########################################################################

atxy7o.upload.workaround=
atxy7o.build.millistimer=D0
atxy7o.build.bootload=opti
atxy7o.build.board=AVR_ATtinyxy7
atxy7o.build.mcu=attiny{build.attiny}
atxy7o.build.serialeventabr=
atxy7o.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy7o.build.f_cpu={build.speed}000000L
atxy7o.upload.speed=115200

atxy7o.menu.chip.3217=ATtiny3217
atxy7o.menu.chip.3217.build.board=AVR_ATtiny3217
atxy7o.menu.chip.3217.build.attiny=3217
atxy7o.menu.chip.3217.upload.maximum_size=32256
atxy7o.menu.chip.3217.upload.maximum_data_size=2048
atxy7o.menu.chip.1617=ATtiny1617
atxy7o.menu.chip.1617.build.board=AVR_ATtiny1617
atxy7o.menu.chip.1617.build.attiny=1617
atxy7o.menu.chip.1617.upload.maximum_size=15872
atxy7o.menu.chip.1617.upload.maximum_data_size=2048
atxy7o.menu.chip.817=ATtiny817
atxy7o.menu.chip.817.build.board=AVR_ATtiny817
atxy7o.menu.chip.817.build.attiny=817
atxy7o.menu.chip.817.upload.maximum_size=7680
atxy7o.menu.chip.817.upload.maximum_data_size=512
atxy7o.menu.chip.417=ATtiny417
atxy7o.menu.chip.417.build.board=AVR_ATtiny417
atxy7o.menu.chip.417.build.attiny=417
atxy7o.menu.chip.417.upload.maximum_size=3584
atxy7o.menu.chip.417.upload.maximum_data_size=256
#atxy7o.menu.chip.3227=ATtiny3227
#atxy7o.menu.chip.3227.build.board=AVR_ATtiny3227
#atxy7o.menu.chip.3227.build.millistimer=A0
#atxy7o.menu.chip.3227.build.attiny=3227
#atxy7o.menu.chip.3227.upload.maximum_size=32256
#atxy7o.menu.chip.3227.upload.maximum_data_size=3072
atxy7o.menu.chip.1627=ATtiny1627
atxy7o.menu.chip.1627.build.board=AVR_ATtiny1627
atxy7o.menu.chip.1627.build.millistimer=A0
atxy7o.menu.chip.1627.build.attiny=1627
atxy7o.menu.chip.1627.upload.maximum_size=15872
atxy7o.menu.chip.1627.upload.maximum_data_size=2048
atxy7o.menu.chip.827=ATtiny827
atxy7o.menu.chip.827.build.board=AVR_ATtiny827
atxy7o.menu.chip.827.build.millistimer=A0
atxy7o.menu.chip.827.build.attiny=827
atxy7o.menu.chip.827.upload.maximum_size=7680
atxy7o.menu.chip.827.upload.maximum_data_size=1024
atxy7o.menu.chip.427=ATtiny427
atxy7o.menu.chip.427.build.board=AVR_ATtiny427
atxy7o.menu.chip.427.build.millistimer=A0
atxy7o.menu.chip.427.build.attiny=427
atxy7o.menu.chip.427.upload.maximum_size=3584
atxy7o.menu.chip.427.upload.maximum_data_size=512
atxy7o.menu.chip.1607=ATtiny1607
atxy7o.menu.chip.1607.build.board=AVR_ATtiny1607
atxy7o.menu.chip.1607.build.attiny=1607
atxy7o.menu.chip.1607.build.millistimer=A0
atxy7o.menu.chip.1607.upload.maximum_size=15872
atxy7o.menu.chip.1607.upload.maximum_data_size=1024
atxy7o.menu.chip.807=ATtiny807
atxy7o.menu.chip.807.build.board=AVR_ATtiny807
atxy7o.menu.chip.807.build.attiny=807
atxy7o.menu.chip.807.build.millistimer=A0
atxy7o.menu.chip.807.upload.maximum_size=7680
atxy7o.menu.chip.807.upload.maximum_data_size=512

atxy7o.menu.clocko.20internal=20 MHz Internal
atxy7o.menu.clocko.16internal=16 MHz Internal
atxy7o.menu.clocko.10internal=10 MHz Internal
atxy7o.menu.clocko.8internal=8 MHz Internal
atxy7o.menu.clocko.5internal=5 MHz Internal
atxy7o.menu.clocko.4internal=4 MHz Internal
atxy7o.menu.clocko.1internal=1 MHz Internal
atxy7o.menu.clocko.20extclock=20 MHz External CLOCK
atxy7o.menu.clocko.16extclock=16 MHz External CLOCK
atxy7o.menu.clocko.12extclock=12 MHz External CLOCK
atxy7o.menu.clocko.10extclock=10 MHz External CLOCK
atxy7o.menu.clocko.8extclock=8 MHz External CLOCK
atxy7o.menu.clocko.24extclock=24 MHz External CLOCK (overclocked)
atxy7o.menu.clocko.28extclock=28 MHz External CLOCK (overclocked)
atxy7o.menu.clocko.32extclock=32 MHz External CLOCK (overclocked)
atxy7o.menu.clocko.20internal.build.speed=20
atxy7o.menu.clocko.20internal.build.clocksource=0
atxy7o.menu.clocko.16internal.build.speed=16
atxy7o.menu.clocko.16internal.build.clocksource=0
atxy7o.menu.clocko.10internal.build.speed=10
atxy7o.menu.clocko.10internal.build.clocksource=0
atxy7o.menu.clocko.8internal.build.speed=8
atxy7o.menu.clocko.8internal.build.clocksource=0
atxy7o.menu.clocko.5internal.build.speed=5
atxy7o.menu.clocko.5internal.build.clocksource=0
atxy7o.menu.clocko.4internal.build.speed=4
atxy7o.menu.clocko.4internal.build.clocksource=0
atxy7o.menu.clocko.1internal.build.speed=1
atxy7o.menu.clocko.1internal.build.clocksource=0
atxy7o.menu.clocko.20extclock.build.speed=20
atxy7o.menu.clocko.20extclock.build.clocksource=2
atxy7o.menu.clocko.16extclock.build.speed=16
atxy7o.menu.clocko.16extclock.build.clocksource=2
atxy7o.menu.clocko.12extclock.build.speed=12
atxy7o.menu.clocko.12extclock.build.clocksource=2
atxy7o.menu.clocko.10extclock.build.speed=10
atxy7o.menu.clocko.10extclock.build.clocksource=2
atxy7o.menu.clocko.8extclock.build.speed=8
atxy7o.menu.clocko.8extclock.build.clocksource=2
atxy7o.menu.clocko.24extclock.build.speed=24
atxy7o.menu.clocko.24extclock.build.clocksource=2
atxy7o.menu.clocko.28extclock.build.speed=28
atxy7o.menu.clocko.28extclock.build.clocksource=2
atxy7o.menu.clocko.32extclock.build.speed=32
atxy7o.menu.clocko.32extclock.build.clocksource=2
atxy7o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy7o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy7o.menu.clocko.5internal.bootloader.OSCCFG=0x02
# all others are handled by the default of 16 MHz

atxy7o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy7o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy7o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy7o.menu.bodvoltage.2v1=2.1V (unofficial except on 2-series)
atxy7o.menu.bodvoltage.2v9=2.9V (unofficial except on 2-series)
atxy7o.menu.bodvoltage.3v3=3.3V (unofficial except on 2-series)
atxy7o.menu.bodvoltage.3v7=3.7V (unofficial except on 2-series)
atxy7o.menu.bodvoltage.4v0=4.0V (unofficial except on 2-series)
atxy7o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy7o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy7o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

